app/controllers/blooming_days_controller.rb

  def index
    if params[:query].present?

      @sellers = []
      @items = Item.where("name LIKE?", "%#{params[:query]}%")

      @items.each do |item|
        @sellers.push item.seller
      end

      @pagy, @sellers = pagy_array(@sellers, items: 5)

    else
      @sellers = Seller.all
---
SELECT "sellers".* FROM "sellers"

  def show
    @seller = Seller.find(params[:id])
    @comment = Comment.all
    @items = Item.all
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items"