app/controllers/comments_controller.rb

  def create

    seller = Seller.find(params[:id])
    comment = seller.comments.create(body: params[:body], name: params[:name])
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "seller_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "왜안보이지"], ["seller_id", 1], ["body", "보인다"], ["created_at", "2020-04-29 10:53:10.155169"], ["updated_at", "2020-04-29 10:53:10.155169"]]