app/views/blooming_days/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."seller_id" = ?  [["seller_id", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."seller_id" = ?  [["seller_id", 1]]
---
        <div class="detail_section_name">
            <span id="item_detail">판매리스트 (<%= @seller.items.count %>)</span>

SELECT "items".* FROM "items" WHERE "items"."seller_id" = ?  [["seller_id", 1]]
---
    <div class="item_table">
        <% @seller.items.each do |item|%>

SELECT "comments".* FROM "comments" WHERE "comments"."seller_id" = ?  [["seller_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."seller_id" = ?  [["seller_id", 2]]
---
        <div class="detail_section_name">
            <span id="review_detail">리뷰 (<%= @seller.comments.count %>)</span>

SELECT "comments".* FROM "comments" WHERE "comments"."seller_id" = ?  [["seller_id", 1]]
---

        <% @seller.comments.each do |comment| %>